{
  "(Updated": "William D. Pratt Maverick Madness Tournament (Updated September 18, 2024)",
  "(Updated May": "Western Crown Presented by Genesis Basketball (Updated May 21, 2025)",
  "Full Page Content After Expansion": "CBOA Resource Centre\nHome\nGeneral Meetings\nCBOA Library\nPerformance and Assessment\nArbiter Game Rankings 2022-23\nArbiter Rank Expecations\nNOCP\nReferee Development\nMember Services\nSelf Assign\nCBOA Scheduler Updates\nDiscord Setup (Keep Up To Date)\nPerformance & Assessment\nThe Director of Performance and Assessment supervises the Evaluation Committee which selects referees for ASAA Provincial assignments, City Championships, and consideration for the ACAC Panel; this includes ensuring the accessibility and safekeeping of evaluations done within the previous five years. The Director of Performance and Assessment may also coordinate with the Director of Referee Development to identify officials who seek to advance their NOCP level or the level of games they are eligible to officiate. A yearly mentorship program may also fall under the Director of Performance and Assessment's portfolio.\nASAA Provincial Championships Application (Click here)\n\nEvaluation Request (Click here)\nCurrently Open\nMentorship Program\nNo longer accepting new applicants\nEvaluation Rubric\nCBOA uses the most current NOCP 1 and 2 rubrics for the evaluations of its members minus the subsection score requirements. The rationale behind this is to best prepare the membership for their formal evaluations and help identify any areas of improvement as close to the NOCP guidelines as possible. It is the responsibility of every member requesting an evaluation to be familiar with the standards set in the documents below. - Jan 2022\n\nCBOA Evaluation Document (New Officials/NOCP 1) \n\nCBOA Evaluation Document (General/NOCP 2) \n\nCBOA Evaluation Form - NOCP 1 (Evaluators only)\n\nCBOA Evaluation Form - NOCP 2 (Evaluators only)\nStill need help?\nContact the Director of Performance & Assessment: cboa.performance@gmail.com\n  Copyright Calgary Basketball Officials Association 2025"
}